<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы напоминания пароля
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки возвращаются брокером паролей на неудачные
    | попытки обновления пароля в таких случаях, как ошибочный код сброса
    | пароля или неверный новый пароль.
    |
    */

    'password' => 'Шифр должен быть не менее шести символов и совпадать с подтверждением.',
    'reset'    => 'Ваш шифр был изменен!',
    'sent'     => 'Малява для получения нового шифра была отправлена! Ищи сразу в папке Спам.',
    'token'    => 'Ошибочный код сброса шифра.',
    'user'     => 'Не удалось найти дело на пацана с указанным мылом.',
    'throttled' => 'Харэ уже дрочить на мыло.'
];
